Vapi27/gottfa-esp32/src/arena_net.cpp
  // Qui est ce mur. Indispensable des qu'il y en a plusieurs : c'est ce qui
  // permet de balayer le reseau et de dire lequel est lequel.
  j += ",\"name\":\"" + s_name + "\"";
  j += ",\"mac\":\""  + s_mac  + "\"";

  // OTA en mode pull : ou en est le telechargement declenche par /api/otapull.
  j += ",\"otast\":\""  + s_pullStatus + "\"";
  j += ",\"otadone\":"  + String(s_pullDone);
  j += ",\"otatot\":"   + String(s_pullTotal);
  j += ",\"fwgot\":"   + String((uint32_t)s_fwGot);
  j += ",\"fwtot\":"   + String((uint32_t)s_fwTotal);
#ifdef ARENA_MATTER
  // A combien de maisons la carte appartient. Si Maison dit "deja dans une autre
  // maison", c'est ce nombre qu'il faut regarder avant de conclure quoi que ce soit.
  j += ",\"fabrics\":" + String((int)arena_matter_fabrics());
  j += ",\"mev\":\"" + String(arena_matter_last_event()) + "\"";
  { char ev[560]; arena_matter_event_log(ev, sizeof(ev));
    j += ",\"mevlog\":\"" + String(ev) + "\""; }
#endif
  // Empreinte de build : les 8 premiers octets du SHA256 de l'ELF. C'est le SEUL
  // champ qui prouve qu'une OTA a bien remplace l'image - l'uptime ne prouve
  // rien (un envoi qui plante redemarre la carte exactement pareil), et un
  // compteur remis a zero au boot non plus.
  {
    const esp_app_desc_t* d = ARENA_APP_DESC();
    char sha[17];
    for (int i = 0; i < 8; i++) sprintf(sha + i * 2, "%02x", d->app_elf_sha256[i]);
    sha[16] = 0;
    j += ",\"build\":\"" + String(sha) + "\"";
  }
  j += ",\"ip\":\""   + s_ip + "\",\"net\":\"" + s_mode + "\"";
  j += ",\"staFail\":\"" + s_staReason + "\"";
  j += ",\"reset\":\"" + s_reset + "\",\"boots\":" + String(s_boots);
  j += ",\"brownouts\":" + String(s_brownouts);
  j += ",\"txpwr\":" + String(s_txq / 4.0f, 2);
  j += ",\"txDerated\":" + String(s_txDerated ? 1 : 0);
  j += ",\"flashMb\":" + String(s_flashPhys >> 20);
  j += ",\"partMb\":"  + String(s_partEnd >> 20);
  j += ",\"flashBad\":" + String(s_flashBad ? 1 : 0);
  j += ",\"statusLed\":" + String(s_statOn ? 1 : 0);
  j += ",\"statusBright\":" + String(s_statBright);
  // La page doit savoir QUI possede le reseau. Sous Matter, l'appairage apporte
  // les identifiants et il n'y a rien a saisir ; sans Matter, la saisie est le
  // SEUL moyen de rejoindre un reseau. Afficher le discours Matter dans une
  // image qui n'en a pas, c'est dire au proprietaire qu'il n'a rien a faire
  // pendant qu'on lui retire le seul geste qui marche.
#ifdef ARENA_MATTER
  j += ",\"matter\":1";
#else
  j += ",\"matter\":0";
#endif
  j += ",\"up\":"     + String(millis() / 1000);
  j += ",\"heap\":"   + String(ESP.getFreeHeap());
  j += "}";
  return j;
}

// Verrou de niveaux : l'un bouge, l'autre suit. On conserve le RAPPORT et non
// l'ecart, parce que c'est le rapport qu'on percoit comme "le meme equilibre"
// quand on monte ou descend l'ensemble. Le rapport n'est pas defini quand la
// source part de zero : dans ce seul cas on reporte l'ECART, faute de quoi un
// fond descendu a 0 y resterait pour toujours et le verrou aurait l'air casse.
static uint8_t followLevel(int from, int to, int other) {
  if (from == to) return (uint8_t)other;
  long v = (from > 0) ? lroundf((float)other * (float)to / (float)from)
                      : (long)other + (to - from);
  if (v < 0) v = 0;
  if (v > 255) v = 255;
  return (uint8_t)v;
}

static uint8_t param8(AsyncWebServerRequest* r, const char* k, uint8_t cur) {
  if (!r->hasParam(k)) return cur;
  long v = r->getParam(k)->value().toInt();
  if (v < 0) v = 0;
  if (v > 255) v = 255;
  return (uint8_t)v;
}

static void startServer() {
  // --- UI ---------------------------------------------------------------
  s_server.on("/", HTTP_GET, [](AsyncWebServerRequest* r) {
    // La page compressee d'abord. Ce n'est pas de l'economie de place, c'est du
    // temps d'antenne : mesure sur la carte, servir les 70 ko de la page fait
    // tomber la cadence de rendu de 60,3 a 55,7 trames/s, et surtout une
    // interruption WiFi qui tombe DANS un s_strip.show() (2,4 ms pour 75 pixels)
    // depasse les 50 us de silence que les WS2812 lisent comme une fin de trame :
    // tout ce qui suit dans la chaine recoit la suite comme une nouvelle trame et
    // decroche. D'ou des pixels qui sautent en bout de chaine quand on rafraichit
    // la page. 71,5 ko -> 25,9 ko, c'est 2,8 fois moins de fenetre pour ca.
    //
    // ATTENTION : arena.html.gz est genere, pas edite. Apres toute modification de
    // data/arena.html il faut refaire  gzip -9 -k -f data/arena.html  avant
    // buildfs, sinon la carte sert l'ancienne interface sans rien signaler.
    if (LittleFS.exists("/arena.html.gz")) {
      AsyncWebServerResponse* rsp = r->beginResponse(LittleFS, "/arena.html.gz", "text/html");
      rsp->addHeader("Content-Encoding", "gzip");
      r->send(rsp);
    }
    else if (LittleFS.exists("/arena.html")) r->send(LittleFS, "/arena.html", "text/html");
    else                                     r->send_P(200, "text/html", FALLBACK);
  });

  // --- State / control ----------------------------------------------------
  s_server.on("/api/state", HTTP_GET, [](AsyncWebServerRequest* r) {
    r->send(200, "application/json", stateJson());
  });

  //  /api/set?mode=arena&bright=180&speed=128&r=255&g=100&b=0&w=0&count=100&budget=9000&order=grbw
  s_server.on("/api/set", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("mode")) {
      arenaled::Mode m = arenaled::modeFromName(r->getParam("mode")->value().c_str());
      if (m == arenaled::MODE_COUNT) { r->send(400, "text/plain", "bad mode"); return; }
      arenaled::setMode(m);
    }
    if (r->hasParam("bright")) arenaled::setBrightness(param8(r, "bright", arenaled::brightness()));
    if (r->hasParam("speed"))  arenaled::setSpeed(param8(r, "speed", arenaled::speed()));
    if (r->hasParam("lock")) arenaled::setLevelLock(r->getParam("lock")->value().toInt() != 0);
    if (r->hasParam("framehz")) arenaled::setFrameHz(param8(r, "framehz", arenaled::frameHz()));
    if (r->hasParam("insb")) arenaled::setInsBright(param8(r, "insb", arenaled::insBright()));
    // Les deux etages permanents, traites ensemble parce que le verrou fait
    // dependre l'un de l'autre. Bouger les DEUX dans la meme requete est un
    // reglage explicite : le verrou ne s'en mele pas, sans quoi on ne pourrait
    // plus jamais refixer l'equilibre une fois verrouille.
    if (r->hasParam("gi") || r->hasParam("champ")) {
      const uint8_t oldG = arenaled::gi(), oldC = arenaled::champ();
      uint8_t newG = param8(r, "gi", oldG), newC = param8(r, "champ", oldC);
      if (arenaled::levelLock()) {
        // Le suiveur se deduit du couple de REFERENCE, pas de la valeur courante
        // - sinon un ecretage a 255 se propage dans le rapport et l'aller-retour
        // ne redonne plus la valeur de depart.
        const uint8_t rg = arenaled::levelRefGi(), rc = arenaled::levelRefChamp();
        if (r->hasParam("gi") && !r->hasParam("champ"))      newC = followLevel(rg, newG, rc);
        else if (r->hasParam("champ") && !r->hasParam("gi")) newG = followLevel(rc, newC, rg);
      }
      arenaled::setGi(newG);
      arenaled::setChamp(newC);
      // Poser les deux ensemble redefinit l'equilibre.
      if (r->hasParam("gi") && r->hasParam("champ")) arenaled::setLevelRef(newG, newC);
    }
    if (r->hasParam("density")) arenaled::setDensity(param8(r, "density", arenaled::density()));
    if (r->hasParam("warm"))   arenaled::setWarm(param8(r, "warm", arenaled::warm()));
    if (r->hasParam("inc"))    arenaled::setIncandescent(r->getParam("inc")->value().toInt() != 0);
    if (r->hasParam("boot"))   arenaled::setBootOn(r->getParam("boot")->value().toInt() != 0);
    if (r->hasParam("r") || r->hasParam("g") || r->hasParam("b") || r->hasParam("w")) {
      arenaled::Rgbw c = arenaled::color();
      c.r = param8(r, "r", c.r);
      c.g = param8(r, "g", c.g);
      c.b = param8(r, "b", c.b);
      c.w = param8(r, "w", c.w);
      arenaled::setColor(c);
    }
    if (r->hasParam("gir") || r->hasParam("gig") ||
        r->hasParam("gib") || r->hasParam("giw")) {
      arenaled::Rgbw c = arenaled::giColor();
      c.r = param8(r, "gir", c.r);
      c.g = param8(r, "gig", c.g);
      c.b = param8(r, "gib", c.b);
      c.w = param8(r, "giw", c.w);
      arenaled::setGiColor(c);
    }
    if (r->hasParam("order")) {
      if (!arenaled::setOrder(r->getParam("order")->value().c_str())) {
        r->send(400, "text/plain", "bad order (grbw|rgbw|gbrw|brgw|rbgw|bgrw)");
        return;
      }
    }
    if (r->hasParam("count"))  arenaled::setCount((uint16_t)r->getParam("count")->value().toInt());
    if (r->hasParam("budget")) arenaled::setBudgetMa((uint16_t)r->getParam("budget")->value().toInt());
    if (r->hasParam("repeater")) arenaled::setRepeater(r->getParam("repeater")->value().toInt() != 0);
    if (r->hasParam("pin"))      arenaled::setPin((uint8_t)r->getParam("pin")->value().toInt());
    if (r->hasParam("statuspin")) {
      const uint8_t p = (uint8_t)r->getParam("statuspin")->value().toInt();
      if (p <= 48) {
        s_statPin = p;
        s_prefs.putUChar("statpin", p);
      }
    }
    // /api/set?btnup=7&btndown=15&btnok=17
    // Les trois ensemble : un remappage partiel laisserait deux roles sur la
    // meme broche, donc un poussoir muet et un autre qui fait deux choses.
    if (r->hasParam("btnup") && r->hasParam("btndown") && r->hasParam("btnok")) {
      arenaoled::setButtons((uint8_t)r->getParam("btnup")->value().toInt(),
                            (uint8_t)r->getParam("btndown")->value().toInt(),
                            (uint8_t)r->getParam("btnok")->value().toInt());
    }
    // /api/set?btnrot=1 : faire tourner les roles d'un cran, a l'aveugle.
    if (r->hasParam("btnrot")) arenaoled::rotateButtons();
    // /api/set?statusbright=0..255 - le temoin de la carte, pas le mur.
    if (r->hasParam("statusbright")) {
      long v = r->getParam("statusbright")->value().toInt();
      if (v < 0)   v = 0;
      if (v > 255) v = 255;
      s_statBright = (uint8_t)v;
      s_prefs.putUChar("statbr", s_statBright);
    }
    if (r->hasParam("statusled")) {
      s_statOn = r->getParam("statusled")->value().toInt() != 0;
      s_prefs.putUChar("staten", s_statOn ? 1 : 0);
      Serial.printf("[net] pixel de statut : %s\n", s_statOn ? "allume (il peut couper la chaine)" : "eteint");
    }
    // /api/set?txpwr=13   puissance d emission en dBm (2..20). Baisser echange
    // de la portee contre des rafales de courant plus petites : c est le seul
    // levier logiciel sur un brownout, et il ne repare pas une alimentation.
    if (r->hasParam("txpwr")) {
      float d = r->getParam("txpwr")->value().toFloat();
      if (d < 2)  d = 2;
      if (d > 20) d = 20;
      s_txq = (uint8_t)lroundf(d * 4.0f);
      s_txDerated = false;              // choix explicite du proprietaire
      s_prefs.putUChar("txq", s_txq);
      applyTxPower();
    }
    r->send(200, "application/json", stateJson());
  });

