Vapi27/gottfa-esp32/src/arena_net.cpp
  // Un pixel, sa luminosite et sa teinte.
  //   /api/pixel?led=37                 -> ce qu'il porte
  //   /api/pixel?led=37&trim=180        -> sa luminosite propre (0..255, 255 = neutre)
  //   /api/pixel?led=37&r=255&g=40&b=0  -> sa teinte
  //
  // Les deux ne vont PAS au meme endroit, et c'est deliberé. La luminosite est
  // ecrite sur le pixel : elle corrige la lampe - dispersion du lot, taille de
  // l'insert, epaisseur du plastique - et ces causes suivent la LED. La teinte
  // est ecrite sur l'INSERT : c'est le plastique moule, il reste sur le plateau
  // quand on refait passer le fil autrement.
  //
  // Consequence assumee : demander une teinte pour un pixel qui n'est pas encore
  // pose n'a nulle part ou aller. On le DIT, avec le geste qui manque. Accepter
  // en silence rendrait un reglage qui ne se voit jamais.
  // --- la photo du plateau, et les points dessus ---------------------------
  //
  // POST /api/pfimg  (corps = le JPEG brut)  -> /pf.jpg
  // Le plan prefere /pf.jpg quand il existe et retombe sur le playfield.jpg
  // livre sinon. Deux fichiers separes, deliberement : une photo televersee est
  // le travail du proprietaire, et /update?target=fs reecrit toute la partition
  // - c'est deja ce qui avait fait perdre la cartographie une fois. Le sien
  // porte un autre nom pour que la prochaine mise a jour de l'interface ne
  // l'emporte pas avec elle.
  s_server.on("/api/pfimg", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      const bool ok = LittleFS.exists("/pf.jpg") && LittleFS.open("/pf.jpg", "r").size() > 0;
      r->send(ok ? 200 : 400, "text/plain", ok ? "photo enregistree" : "rien recu");
    },
    nullptr,
    [](AsyncWebServerRequest* r, uint8_t* data, size_t len, size_t index, size_t total) {
      static File up;
      if (index == 0) {
        up = LittleFS.open("/pf.jpg", "w");
        Serial.printf("[pf] photo entrante, %u octets\n", (unsigned)total);
      }
      if (up) up.write(data, len);
      if (up && index + len >= total) { up.close(); Serial.println("[pf] photo enregistree"); }
    });

  // --- Son d'attract -------------------------------------------------------
  //
  // Le fichier est joue par le NAVIGATEUR, pas par la carte : le mur n'a ni
  // amplificateur ni haut-parleur, et l'ESP32 a mieux a faire que decoder un
  // MP3 pendant qu'il pousse des trames - toute la correction du pilote RMT
  // consiste justement a ne rien laisser preempter la sortie.
  //
  // La source est laissee ouverte a dessein. Capturer le son de la ROM sous
  // PinMAME ne marche pas avec cette bibliotheque : le rappel audio est bien
  // appele mais toujours avec 0 echantillon, meme en declenchant des sons a la
  // main (mixer_samples_this_frame() rend 0, le mixeur n'a jamais demarre).
  // Un enregistrement de la vraie machine est de toute facon plus fidele qu'une
  // emulation.
  s_server.on("/api/sound", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!LittleFS.exists("/attract.mp3")) { r->send(404, "text/plain", "aucun son"); return; }
    AsyncWebServerResponse* rsp = r->beginResponse(LittleFS, "/attract.mp3", "audio/mpeg");
    r->send(rsp);
  });

  s_server.on("/api/sound", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      size_t sz = 0;
      if (LittleFS.exists("/attract.mp3")) { File f = LittleFS.open("/attract.mp3", "r"); sz = f.size(); f.close(); }
      r->send(sz ? 200 : 400, "text/plain", sz ? "son enregistre" : "rien recu");
    },
    nullptr,
    [](AsyncWebServerRequest* r, uint8_t* data, size_t len, size_t index, size_t total) {
      static File up;
      static bool full = false;
      if (index == 0) {
        full = false;
        // Refuser AVANT d'ecrire : remplir LittleFS a ras bord rend la carte
        // inflashable par OTA fs, ce qui coute bien plus cher qu'un son absent.
        const size_t libre = LittleFS.totalBytes() - LittleFS.usedBytes();
        if (total + 32768 > libre) {
          full = true;
          Serial.printf("[son] refuse : %u octets pour %u libres\n",
                        (unsigned)total, (unsigned)libre);
          return;
        }
        up = LittleFS.open("/attract.mp3", "w");
        Serial.printf("[son] entrant, %u octets\n", (unsigned)total);
      }
      if (full) return;
      if (up) up.write(data, len);
      if (up && index + len >= total) { up.close(); Serial.println("[son] enregistre"); }
    });

  s_server.on("/api/sound", HTTP_DELETE, [](AsyncWebServerRequest* r) {
    LittleFS.remove("/attract.mp3");
    r->send(200, "text/plain", "son retire");
  });

  s_server.on("/api/pfimg", HTTP_DELETE, [](AsyncWebServerRequest* r) {
    LittleFS.remove("/pf.jpg");
    r->send(200, "text/plain", "photo retiree - retour au plateau livre");
  });

  // Poser, deplacer, retirer un point sur la photo. C'est le geste qui rend le
  // mur possible pour une machine que le depot ne connait pas : pas de table
  // Visual Pinball, pas de ROM, juste une photo et quelqu'un qui sait ou sont
  // ses inserts.
  //   /api/insert/add?x=0.42&y=0.71&n=pop-gauche
  //   /api/insert/move?i=12&x=0.44&y=0.70
  //   /api/insert/del?i=12
  s_server.on("/api/insert/add", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("x") || !r->hasParam("y")) { r->send(400, "text/plain", "x= et y= (0..1) requis"); return; }
    const int i = arenapf::addInsert(r->getParam("x")->value().toFloat(),
                                     r->getParam("y")->value().toFloat(),
                                     r->hasParam("n") ? r->getParam("n")->value().c_str() : nullptr);
    if (i < 0) { r->send(400, "text/plain", "table pleine"); return; }
    arenapf::saveInserts();
    r->send(200, "application/json", "{\"insert\":" + String(i) + "}");
  });
  s_server.on("/api/insert/move", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("i") || !r->hasParam("x") || !r->hasParam("y")) {
      r->send(400, "text/plain", "i=, x= et y= requis"); return;
    }
    if (!arenapf::moveInsert((uint8_t)r->getParam("i")->value().toInt(),
                             r->getParam("x")->value().toFloat(),
                             r->getParam("y")->value().toFloat())) {
      r->send(400, "text/plain", "point inconnu"); return;
    }
    arenapf::saveInserts();
    r->send(200, "text/plain", "deplace");
  });
  s_server.on("/api/insert/del", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("i")) { r->send(400, "text/plain", "i= requis"); return; }
    if (!arenapf::removeInsert((uint8_t)r->getParam("i")->value().toInt())) {
      r->send(400, "text/plain", "point inconnu"); return;
    }
    arenapf::saveInserts();
    arenapf::save();                 // les affectations ont ete recalees
    r->send(200, "text/plain", "retire");
  });

  s_server.on("/api/pixel", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("led")) { r->send(400, "text/plain", "led= requis"); return; }
    const long led = r->getParam("led")->value().toInt();
    if (led < 0 || led >= LED_MAX) { r->send(400, "text/plain", "led hors chaine"); return; }

    if (r->hasParam("trim")) {
      long v = r->getParam("trim")->value().toInt();
      if (v < 0)   v = 0;
      if (v > 255) v = 255;
      arenapf::setTrim((uint16_t)led, (uint8_t)v);
      arenapf::saveTrims();
    }

    const uint8_t ins = arenapf::ledInsert((uint16_t)led);
    if (r->hasParam("r") || r->hasParam("g") || r->hasParam("b") || r->hasParam("w")) {
      if (ins == arenapf::UNASSIGNED) {
        r->send(409, "text/plain",
                "ce pixel n'est pose sur aucun insert : la teinte est une propriete "
                "de l'insert (le plastique), pas du fil. Placer le pixel d'abord "
                "(assistant de cartographie), puis recommencer.");
        return;
      }
      arenapf::Colour c = arenapf::colourOf(ins);
      if (r->hasParam("r")) c.r = (uint8_t)r->getParam("r")->value().toInt();
      if (r->hasParam("g")) c.g = (uint8_t)r->getParam("g")->value().toInt();
      if (r->hasParam("b")) c.b = (uint8_t)r->getParam("b")->value().toInt();
      if (r->hasParam("w")) c.w = (uint8_t)r->getParam("w")->value().toInt();
      arenapf::setColour(ins, c);
      arenapf::saveColours();
    }

